In [1]:
#Librarires
import pandas as pd
import numpy as np

In [2]:
#Loading the data
df = pd.read_csv('marketing_campaign.csv', sep = '\t')
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [3]:
#Information on the Features
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [4]:
#Dropping the NA values
df = df.dropna()
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [5]:
#Converting DT_customer to Date
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'])
df.dtypes

ID                              int64
Year_Birth                      int64
Education                      object
Marital_Status                 object
Income                        float64
Kidhome                         int64
Teenhome                        int64
Dt_Customer            datetime64[ns]
Recency                         int64
MntWines                        int64
MntFruits                       int64
MntMeatProducts                 int64
MntFishProducts                 int64
MntSweetProducts                int64
MntGoldProds                    int64
NumDealsPurchases               int64
NumWebPurchases                 int64
NumCatalogPurchases             int64
NumStorePurchases               int64
NumWebVisitsMonth               int64
AcceptedCmp3                    int64
AcceptedCmp4                    int64
AcceptedCmp5                    int64
AcceptedCmp1                    int64
AcceptedCmp2                    int64
Complain                        int64
Z_CostContact                   int64
Z_Revenue                       int64
Response                        int64
dtype: object

In [6]:
#Counting the values in Marital Status
df['Marital_Status'].value_counts()

Married     857
Together    573
Single      471
Divorced    232
Widow        76
Alone         3
Absurd        2
YOLO          2
Name: Marital_Status, dtype: int64

In [7]:
#Notice how we have different responses. Let's make this more diverse and egalitarian
df['LivingStatus'] = df['Marital_Status'].replace({'Married':'Partner', 'Together':'Partner', 'Single':'Single', 'Divorced':'Single', 'Widow':'Single',
                                                     'Alone':'Single' ,'Absurd':'Single', 'YOLO':'Single'})
df['LivingStatus'].value_counts()

Partner    1430
Single      786
Name: LivingStatus, dtype: int64

In [8]:
#Education looks clean so we will leave that a lone.
df['Education'].value_counts()

Graduation    1116
PhD            481
Master         365
2n Cycle       200
Basic           54
Name: Education, dtype: int64

In [9]:
#Changing Education Status to Undergrad, Graduate, Postgrad
df["Education"]=df["Education"].replace({'Graduation':'Graduated', 'PhD':'Postgrad', 'Master':'Postgrad',
                                         '2n Cycle':'Undergrad', 'Basic':'Undergrad',})
df['Education'].value_counts()

Graduated    1116
Postgrad      846
Undergrad     254
Name: Education, dtype: int64

In [10]:
#Converting Year_Birth to today Age
df['Age'] = 2021 - df['Year_Birth']

In [11]:
#Renaming the data for clarity. These columns are amounts ordered in 2 years
df = df.rename(columns = {'MntWines':'Wines', 'MntFruits':'Fruits', 'MntMeatProducts':'Meat', 'MntFishProducts':'Fish',
                          'MntSweetProducts':'Sweets', 'MntGoldProds':'Gold'})

In [12]:
#Getting a total amount ordered in 2 years
df['TotalSpent'] = df['Wines']+df['Fruits']+df['Meat']+df['Fish']+df['Sweets']+df['Gold']

In [13]:
#Combining Kidhome and Teenhome as children
df['Children'] = df['Kidhome']+df['Teenhome']

In [14]:
#Finding if they are Parents and putting into one hots.
df['Parents'] = np.where(df.Children > 0,1,0)
df['Parents'].value_counts()

1    1583
0     633
Name: Parents, dtype: int64

In [15]:
#Creating a column for the size of the family.
df['FamilySize']= df['LivingStatus'].replace({'Single':1, 'Partner':2}) + df['Children']
df['FamilySize']

0       1
1       3
2       2
3       3
4       3
       ..
2235    3
2236    5
2237    1
2238    3
2239    4
Name: FamilySize, Length: 2216, dtype: int64

In [16]:
#Dropping Redundant Features/Columns
#We are dropping  ZRevenue and ZCostContact have the same value and has no significate for our data.
#Also droping Accepted Promotion, complain, response.
drop = ['Year_Birth','Marital_Status','ID','Z_CostContact','Z_Revenue', 'AcceptedCmp1', 'AcceptedCmp2', 'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'Complain', 'Response', 'Dt_Customer']
df= df.drop(drop, axis =1)

In [17]:
df

,Education,Income,Kidhome,Teenhome,Recency,Wines,Fruits,Meat,Fish,Sweets,...,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,LivingStatus,Age,TotalSpent,Children,Parents,FamilySize
0,Graduated,58138.0,0,0,58,635,88,546,172,88,...,8,10,4,7,Single,64,1617,0,0,1
1,Graduated,46344.0,1,1,38,11,1,6,2,1,...,1,1,2,5,Single,67,27,2,1,3
2,Graduated,71613.0,0,0,26,426,49,127,111,21,...,8,2,10,4,Partner,56,776,0,0,2
3,Graduated,26646.0,1,0,26,11,4,20,10,3,...,2,0,4,6,Partner,37,53,1,1,3
4,Postgrad,58293.0,1,0,94,173,43,118,46,27,...,5,3,6,5,Partner,40,422,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Graduated,61223.0,0,1,46,709,43,182,42,118,...,9,3,4,5,Partner,54,1341,1,1,3
2236,Postgrad,64014.0,2,1,56,406,0,30,0,0,...,8,2,5,7,Partner,75,444,3,1,5
2237,Graduated,56981.0,0,0,91,908,48,217,32,12,...,2,3,13,6,Single,40,1241,0,0,1
2238,Postgrad,69245.0,0,1,8,428,30,214,80,30,...,6,5,10,3,Partner,65,843,1,1,3
2239,Postgrad,52869.0,1,1,40,84,3,61,2,1,...,3,1,4,7,Partner,67,172,2,1,4

In [19]:
df.to_csv('CleanPA.csv', index=False)